src/Documents/УстановкаОкладовСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>УстановкаОкладовСотрудников</Name>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОкладыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Оклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УстановкаОкладовСотрудников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ОкладыСотрудникПриИзмененииНаСервере(Сотрудник)
	Результат = Новый Структура("Должность			, Подразделение"
							   , Сотрудник.Должность, Сотрудник.Подразделение);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОкладыСотрудникПриИзменении(Элемент)
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	ДанныеСотрудника = ОкладыСотрудникПриИзмененииНаСервере(ТекДанные.Сотрудник);
	ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеСотрудника);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОкладыДолжностьПриИзмененииНаСервере(Должность)
	Возврат Новый Структура("Подразделение", Должность.Подразделение);
КонецФункции

&НаКлиенте
Процедура ОкладыДолжностьПриИзменении(Элемент)
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	ДанныеДолжности = ОкладыДолжностьПриИзмененииНаСервере(ТекДанные.Должность);
	ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеДолжности);
КонецПроцедуры
